{"pageProps":{"content":"<h1>About me</h1>\n<p>I am an open-source software engineer with 4+ years of experience developing production applications for my\ncurrent role and contributing to open-source projects and over a year experience as an open-source maintainer.\nI enjoy identifying issues or areas of improvement and developing solutions to address those areas.</p>\n<h2>Background Overview</h2>\n<p>My technical background began in High School where I took engineering course work through Project Lead the Way for all 4 years\nand eventually into college where I was first exposed to programming with a introduction class to C. A few years later in 2018,\nthis background would help when I decided to wireframe a potential new site design for my then job.</p>\n<p>In 2019, while working my first job out of graduate school, I noticed some processes that could be improved with automation, so\nI began creating some small tools to automate tasks and/or easy parts of processes at work (some of which are used to various\ndegrees today).</p>\n<p>These tools grew more robust until I created my main project for that role, the <code>productcontentdesktopapp</code>, which functions\nas a staging area/mini CMS for the operations team. The application itself has a few interfaces for interacting with content\nand an content engine that can generate content based off product attributes. I would continue to develop and maintain this\nproject for the next four years.</p>\n<p>Around 2020, I also began learning Rust and using it on small personal projects until I made my first open source contribution\nto <code>Boa</code> in October 2021 followed shortly by another.</p>\n<p>Since then, I've been working on learning more Rust and helping make contributions to <code>Boa</code>.</p>\n<p>Most recently, I've been working on implementing the new <code>Temporal</code> builtin specification for <code>Boa</code>.</p>\n<h1>More about me</h1>\n<p>I like hiking, games (board and video), books and movies, and programming. Always enjoy going out and enjoying nature / the world.</p>"},"__N_SSG":true}