{"pageProps":{"meta":{"title":"Call Me a Convert (Next.js Part 2)","date":"8/6/2023","summary":"Coping about coming to like Next.js"},"content":"<p>Huh, well who would've thought that. I used Next.js again...literally right after I got finished writing a blog about\nhow cumbersome it was. Sometimes it really is better to just not open up your mouth too soon or don't count your eggs\nbefore they hatch, or any other euphemism that may work.</p>\n<p>While I'm still not totally sold on Next, I do think I've grown a relative appreciation for what it's doing.</p>\n<h3>Let's Zoom Out</h3>\n<p>I mentioned on the last post that I had a project that I was more interested working on, but needed this site up and\nrunning. Well it's finely complete! See link on main page to the Boa Debugger POC.</p>\n<p>I've been playing around with the idea of doing a full debugging suite ever since I saw a conference talk where I guy had\nsetup a site to explain JS's call stack. It was really cool in the presentation, but when I went to the site, it wasn't\nthere anymore. It was disappointing to say the least, but it also really made me want to try building something similiar. Of\ncourse, this all went on the back burner.</p>\n<h3>And time passed</h3>\n<p>Life can be hectic sometimes. And things that are put on the back burner can really start to disappear, which was the case\nwith trying to reimplement that call stack tool. And then, someone offered to make a new website for Boa, complete with\nnew React-based Boa Playground.</p>\n<p>Fun fact, Boa has a really unique functionality being written in Rust: it is able to be compiled to WASM and shipped to the\nbrowser. So the engine pretty much natively (there is obviously a little configuring), can be compiled to WASM via wasm-pack.\nIt's really f-ing cool if you haven't seen it, and you should definitely stop by boajs.dev to check it out.</p>\n<p>Anyways, I had never really thought about updating the old playground, but I was immediately intrigued. What else could we do\nto the playground besides just converting it from a HTML file to React. If we were going to be switching fully over to React,\nwhy not really push the boundary and make a playground/application-suite that really shows off the engine functionality.</p>\n<p>The thought process about this revamped playground is actually coming from multiple angles...not all necessarily good: (1) it could help\nnew contributors get more acquainted with the engine, (2) it's an easy place for someone who may have found a bug to do a\nlittle diagnostic work expediently, (3) it would help build out Boa's WASM shippable with, ideally, a meanful showcase of\nfunctionality, (4) it could provide a learning platform for those new JS/TS programmers who have never gotten too deep\ninto how a JS Engine functions, and (5) it's just really, really, really f-ing cool.</p>\n<h3>Wait, where was I?</h3>\n<p>Oh no, I'm ranting on an aside. Okay well maybe look forward to a completely different blog post on that. Basically,\nI got a shot of adrenaline to try and do that work again.</p>\n<p>The plan was simple: first, create a github.io dev site; second, refactor boa's trace functionality and expose it to\nthe WASM package; and finally, build the tool and deploy it to <code>gh-pages</code> from the main site.</p>\n<p>So I began on a Wednesday hoping to get a quick Markdown blog up and running in about a day and then spend my weekend\nworking on the project with the goal of finishing before weekend was up.</p>\n<p>...</p>\n<p>It was with that mindset that I ran face first into the wall that was Next.js.</p>\n<p>I had heard great things about Next and had seen it thrown around quite often in some YouTube videos, so I thought it\nwould be a great option to put up the site quickly.</p>\n<p>Yes, I know I could have just done Jekyll. Yes, that ultimately probably would've been faster. But \"to hell with Ruby\",\nwas my thought at the time. \"I was just working on adding some functionality to a Docusaurus site, and that was\npainless to pick up. How bad could Next be.\"</p>\n<p>All of a sudden there were mentions of Layouts, relatively uninformative docs that only technically cover \".jsx\" and\ngloss over \".tsx\". And to top it off, I added on trying out Tailwindcss to the entire experience.</p>\n<p>Aside: It would be an understatement to say that the documentation may really and trully be holding Next.js back. I\ndon't know if their Tech Writers aren't being supported by Vercel or they just really and truly don't care about\ntheir docs. Probably the latter given the qualifications I've seen on recent job postings (written with a large degree\nof salt).</p>\n<h3>Positivity Incoming</h3>\n<p>I solemnly swear I'm going to write something good about Next.js.</p>\n<p>To fast forward some (just go read my other blog for context here), I make it through creating and deploying the site,\nand I'm mostly just annoyed. But the thing is that towards the end, it all started to make a little sense: oh, here's\nwhere I can use normal React vs. Next's framework; oh wow, Tailwindcss is really nice...like really nice...this is\nsupported out of the box?</p>\n<p>There are definitely parts that, even now, I'm apprehensive about. I also don't think I really by into the <code>app</code> router\nand server-side rendering. But on the other side of that, I get a pretty neat and intuitive page router, Tailwindcss\nbasically out of the box, and -- well -- React.</p>\n<p>I guess what I'm basically saying is: Next.js is kinda conveneint and easy to getting up off the ground and running.</p>\n<h3>The Real Truth</h3>\n<p>So I had actually made a rather greedy plan: I was going to make the core dev/blog site in Next, and then try out\nSolid.js or Svelte for the new Debugger.</p>\n<p>That was the plan, so I spent the better portion of Saturday afternoon outfitting a branch on my local clone of Boa and\ngot the hooks working.</p>\n<p>All that was left was to make the actually site/web app. So I loaded up solid-start, played around with the fundamentals\na bit, and then went to go download monaco-editor.</p>\n<p>...that was in React.</p>\n<p>Oh, well that won't work. I had seen one earlier this week in Svelte, so let's just pull up the one for Solid.</p>\n<p>Oh, there it is! Posted by someone with an @uwu namespace...and the props are, uh, really annoyingly named...</p>\n<p>And this my dear readers became the classic story of mature ecosystems being hard to step away from.</p>\n<p>I was left with two options: try out Svelte or just load the thing into Next/React and go to town.</p>\n<p>This right here is where I surprised myself.</p>\n<p>Quite honestly, I should have thought: damn, solid won't work for this one, but that means I can try out Svelte, so\nno harm.</p>\n<p>But what I really thought is: huh, I can just load this up in a new Next app and put this page together in no time.</p>\n<p>And so, I did.</p>\n<h3>In Conclusion</h3>\n<p>And so, I guess I'm a convert.</p>\n<p>Yes, I can actually see myself using Next.js again. It may even be my go to for the forseeable future.</p>\n<p>Do I think it's perfect? No, and I'll keep looking out for something else.</p>\n<p>Maybe, Solid's ecosystem will get better or this project wasn't well suited towards Solid's strengths (skill\nissue is also on the table).</p>\n<p>Maybe, I'll try Svelte and it's will make me want to never touch React again like Tailwind has made\nme never want to touch Sass again.</p>\n<p>Only time will tell.</p>"},"__N_SSG":true}