{"pageProps":{"meta":{"title":"Let's talk about Conventional Comments","date":"10/16/2023"},"content":"<p>While exploring GitHub repositories and their <code>README.md</code>s, you come across various concepts and\nintrigues that draws you in. I'd be lying if I said I wasn't a kid in a candy shop in some sense,\nlooking at all the different treats there are.</p>\n<p>Many of these treats will mostly boil down to an 'Oh, so that's how it is\" or a \"Huh, I need to look into\nthis more\". But recently I happened upon one concept that is so benal and yet absolutely fascinating\nand perfectly addressed one of the personal frustrations I had: <a href=\"https://conventionalcomments.org/\">Conventional Comments</a></p>\n<h2>The Code Review(tm): Death by a Thousand Cuts</h2>\n<p>Okay, so maybe this title is a bit dramatic and hyperbolic, but as with every myth or folk story, there is some\nessence of truth that is trying to be addressed or a lesson that can be gleamed.</p>\n<p>Code reviews are phenomenal. As someone who spent over a year+ programming before a code review, there was\nliterally nothing better or more eye opening than a code review. Being able to get feedback and approach some\na PR with some knowledge that you didn't have or an approach that you didn't consider is fantastic. It helps\nyou grow as an individual, but it also helps tease out the best solution.</p>\n<p>Maybe the review comment is correct, maybe the current approach is correct, maybe a completely separate\napproach is correct that can only be determined after teasing it out through discussion</p>\n<p>(Quick aside: the review comment is almost always correct, but let's run with the above both for the flow of\nthis post but also the general argument I'm trying to make).</p>\n<p>Collaboration and multiple points-of-view will always be better than a single person working alone and isolated.</p>\n<p>But ah, here comes the trickiest and hardest part of all collaborative efforts: effective communication.</p>\n<p>After all, a code review only goes as far as the lines of communication, which can become especially stressed\nwhen outside factors are taken into account such as personality, background, language barriers, etc.</p>\n<p>These factors can lead to all sorts of miscommunication from ambiguity that arises from general comments. What\nwas meant as a non-trivial comment could come off as a harsh criticisms or set unclear expectations of the\nreviewee. In this sense, ambiguity is the enemy of both effective communication and collaboration.</p>\n<h2>Mea Culpa</h2>\n<p>I, for one, enjoy adding comments about thoughts that pop up during review. While reviewing, I may read something and\nthink: huh, if we do it like x instead of y, than maybe z would be approachable easier. It's not that these are always\nvaluable or should be actioned. But every now and then, that thought might trigger a separate thought in the reviewee\nthat neither the reviewer or reviewee noticed at first.</p>\n<p>It's not that this scenario happens often, but it can only happen under two conditions: a collaborative environment and\nthe reviewer sharing the thought. I personally believe that that makes those comments all the more valuable to share.</p>\n<p>But here's we come back to the initial problem and trickiest of collab issues: communication.</p>\n<p>How do you effectively share a thought without it coming off as a criticism or request for changes?</p>\n<p>This was a small struggle for me. I found myself almost addicted to: \"Just a thought,...\" and \"Huh, I wonder...\", but\neven that leaves some room for interpretation RE:outside factors.</p>\n<h2>Conventional Comments</h2>\n<p>Conventional Comments provide a direction for review comments that are both concise, clear, and effective.</p>\n<p>My goal here in this post is not to rehash their fantastic examples. But I will share the format proposed:</p>\n<pre><code class=\"hljs language-md\"><span class=\"xml\"><span class=\"hljs-tag\">&#x3C;<span class=\"hljs-name\">label</span>></span></span> [decorations]: <span class=\"xml\"><span class=\"hljs-tag\">&#x3C;<span class=\"hljs-name\">subject</span>></span></span>\n\n[discussion]\n</code></pre>\n<p>While the above is more robust (understandbly so), the core to the conventional comment format, in my\nopinion, can be simply put as:</p>\n<pre><code class=\"hljs language-md\"><span class=\"xml\"><span class=\"hljs-tag\">&#x3C;<span class=\"hljs-name\">label</span>></span></span>: <span class=\"xml\"><span class=\"hljs-tag\">&#x3C;<span class=\"hljs-name\">subject</span>></span></span>\n</code></pre>\n<p>The label here essentially functions to provide the context for which the statement is given in a\ndirect and concise manner. If a comment is a thought, then \"thought:\"; if it's a praise, then \"praise:\";\nif it's a suggestion or issue, then \"suggestion:\" or \"issue:\". It's simple and provides little to no room\nfor ambiguity.</p>\n<p>This little to no room for ambiguity is what makes conventional comments so special to me. It provides a\nframework in which one can communicate in a concise and effective manner while providing the littlest\namount of room for interpretation.</p>\n<p>In this sense, conventional comments cut through the ambiguity, which then allows the collaboration to\nshine.</p>"},"__N_SSG":true}