{"pageProps":{"meta":{"title":"So it's been a while","date":"10/4/2023"},"content":"<p>So, about that commitment to writing weekly...that went a bit out the door, didn't it?</p>\n<h2>Where to begin?</h2>\n<p>So the past month went by WAY faster than intended. Partially because I was hellbent on\non finishing the <code>Temporal</code> branch I had been working on so that it could be\nrelatively mergeable. Once I saw the diff and was able to take more of a 10,000 foot\nview, the bumps became pretty clear. As a result, there was more polishing (not to mention\nthe feedback related changes). so I was pretty focused.</p>\n<p>I was also able to spend a little more time fixing Foggy Forest and putting together\nanother Autumn theme. I may actually publish them. I've been using Foggy Forest pretty\nroutinely, and I honestly really like it. Maybe some other people out there might enjoy\nit just as much.</p>\n<p>No further progress on the Debugger, but there's some ideas I have brewing (halloween pun not\nintended). I may put the project on the backburner for now though at least until there's\na little bit more feedback on the PR.</p>\n<h2>Looking forward</h2>\n<p>I've actually come across a couple things over the course of my blogging absence that I actually\nthink I want to write about a bit more, so hopefully there will be more technical posts up soon.</p>\n<p>But this next month is also starting to look pretty busy.</p>\n<p>First and foremost, the initial <code>Temporal</code> work is relatively close to merging. Once merged,\nI want to pick up the pace of work in smaller, more approachable chunks with my personal\ngoal right now being one PR a week. So that will probably be a mad dash to build out the\nother parts.</p>\n<p>Aside from working on <code>Temporal</code>, Svelte 5 genuinely looks good, and I really want to try to\nbuild something.</p>\n<p>This site has been switched to Foggy Forest, but I'd really like to provide a toggle that\nwill allow any visitors to theme the site as they like.</p>\n<p>I've also really been feeling like diving into some Assembly and Zig if I get the time.</p>\n<p>My hope is to get to as many of these as possible.</p>\n<p>But that will remain to be seen.</p>\n<p>Until next time! :D</p>"},"__N_SSG":true}